#include<stdio.h>
//位运算符

//  与  或  异或    非  左移    右移
//  所有得位操作    都是在二进制基础上进行的
//  异或 相同为0    不同为1     符号：^

int main(int argc, char const *argv[])
{
    int num1 = 60;      //  0011  1100
    int num2 = 80;      //  0101  0000

    int j = 0;
    printf("********************按位与运算**********************\n");
    j = num1 & num2;    //  0001  0000 (与运算)
    printf("%d\n" , j);


    printf("********************按位或运算**********************\n");
    j = num1 | num2;    //  0111  1100 (或运算)
    printf("%d\n" , j);


    printf("********************按位异或运算********************\n");
    j = num1 ^ num2;    //  0110  1100(异或运算)
    printf("%d\n" , j);

    printf("********************按位取反运算********************\n");
    j = ~ num1;         //   (取反运算)
    printf("%d\n" , j);

    printf("********************左移运算************************\n");
    j = num1 << 2;      //   (左移运算)
    printf("%d\n" , j);

    printf("********************右移移运算**********************\n");
    j = num1 >> 2;      //   (右移运算)
    printf("%d\n" , j);
   
    int i = 1;
    i = i << 8;
    printf("%d\n" , i);
    
    return 0;
}
